{
  "version": "v1.46",
  "rules": [
    {
      "rule_id": "shr-00002",
      "type": "strategy",
      "condition": "IF a claim is identified as a compound claim AND includes a specific verbatim textual element (e.g., a direct quote) AND other parts of the compound claim are already supported by evidence",
      "action": "THEN the system MUST prioritize and ensure the complete execution of ALL planned search queries specifically targeting the verification of that verbatim textual element. If initial targeted search results are inconclusive, the system should actively attempt direct verification by consulting the identified primary source (e.g., author's official publication, blog, or original document) for the full context of the claimed content, before making a final determination on the verifiability of the quote.",
      "confidence": 0.75,
      "evidence_count": 1,
      "created_from": "case_20240726_120000",
      "created_at": "2026-01-03 18:10:50.543412",
      "parent_rule": null,
      "description": "This rule prevents false positives by ensuring thorough evidence collection for specific verbatim textual elements within compound claims. It mandates complete execution of targeted search queries and, if necessary, direct verification from primary sources, especially when other parts of the claim are supported, to avoid incorrect conclusions due to incomplete information.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00005",
      "type": "strategy",
      "condition": "When a sub-claim involves verifying a specific verbatim textual element (e.g., a direct quote, a specific phrase from a document, an exact title).",
      "action": "The system must execute highly precise, targeted search queries for the exact phrase, prioritizing evidence that provides the full context or direct quotation from primary sources or highly reliable direct citations. If initial searches yield only summaries, partial content descriptions, or indirect mentions, subsequent search iterations must explicitly and aggressively target the verbatim text to confirm its exact phrasing and existence.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20240726_120000",
      "created_at": "2026-01-03 18:17:17.408737",
      "parent_rule": "shr-00002",
      "description": "This rule refines the strategy for verifying specific verbatim textual elements to prevent false positives. It mandates a robust, multi-stage evidence retrieval strategy: initially, highly precise searches for the exact phrase are required, prioritizing primary sources or direct quotations. If these initial searches yield only partial or summarized information, the system must perform subsequent, even more targeted searches specifically for the verbatim text to ensure accurate verification and prevent incorrect conclusions due to insufficient or imprecise evidence.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00006",
      "type": "strategy",
      "condition": "IF a claim describes a specific visual depiction, style, or characteristic (e.g., 'X as a Y character', 'an image in Z style', 'a photograph of A').",
      "action": "THEN the verification process MUST include a detailed assessment of the visual content itself to ensure its authenticity, adherence to the specified characteristics and constraints (e.g., technical or stylistic rules of Y/Z/A), and an investigation for signs of AI generation, manipulation, or technical inconsistencies, even if the overall event of the visual's posting or existence is confirmed.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20240729_120000",
      "created_at": "2026-01-03 18:18:30.948551",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to verify the authenticity and specific characteristics of visual content described in a claim. It mandates that when a claim specifies a visual depiction (e.g., 'as a Minecraft character', 'in a certain style'), the verification process must extend beyond merely confirming the existence of the post or image. It requires a deeper analysis of the visual content itself to ensure its authenticity, adherence to stated characteristics, and to detect any signs of AI generation or manipulation, preventing incorrect conclusions based on incomplete visual verification.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00007",
      "type": "strategy",
      "condition": "IF a claim contains a temporal phrase specifying a month and year (e.g., 'in [Month] [Year]'), AND the claim describes an event (e.g., a petition, proposal, or review process) that can have a distinct period of activity from its proposed outcome's effective date,",
      "action": "THEN prioritize interpreting the temporal phrase as the contextual period during which the event was active, under review, or concluded. Do not automatically consider it a contradiction if the event's outcome (e.g., a ban) is described as permanent or without a specific end date, unless evidence explicitly links the temporal phrase to the outcome's effective date.",
      "confidence": 0.75,
      "evidence_count": 1,
      "created_from": "case_20231027_120000",
      "created_at": "2026-01-03 18:20:10.132808",
      "parent_rule": null,
      "description": "This rule prevents false positives by ensuring nuanced interpretation of temporal phrases. It mandates prioritizing the understanding of 'in [Month] [Year]' as the period of an event's activity or circulation, rather than automatically assuming it refers to a proposed effective date of an action, especially when that action is described as permanent or indefinite. This avoids incorrect contradictions and ensures accurate contextualization of claims.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00008",
      "type": "strategy",
      "condition": "IF a claim asserts a policy, rule, or prohibition, AND the gathered evidence explicitly contains information about specific exceptions, waivers, or qualifying conditions that modify or limit the application of that policy/rule.",
      "action": "THEN the reasoning process must explicitly identify and integrate these exceptions, waivers, or qualifying conditions into the final verification assessment to provide a comprehensive and nuanced understanding of the claim's validity.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20240729_120000",
      "created_at": "2026-01-03 18:21:26.834037",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to fully synthesize all details from collected evidence, specifically overlooking explicit exceptions or qualifiers to stated policies or rules. It mandates that when a claim asserts a policy, rule, or prohibition, and evidence of specific exceptions, waivers, or qualifying conditions is gathered, these details must be explicitly integrated into the verification assessment to ensure a comprehensive and nuanced understanding of the claim's validity, preventing incomplete conclusions.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00010",
      "type": "strategy",
      "condition": "When a claim asserts the occurrence of a formal, verifiable action (e.g., 'introduced legislation', 'signed bill', 'made a statement') and reliable evidence confirms the factual occurrence of that action, and the claim itself does not explicitly qualify the action with conditions related to its perceived intent or seriousness.",
      "action": "The primary verification focus must be solely on confirming the factual occurrence of the action. Any perceived intent, seriousness, or satirical nature of the subject of the action should be disregarded when assessing the truthfulness of the *occurrence* of the action, leading to a 'True' verdict for the claim of the action's occurrence.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20240726_120000",
      "created_at": "2026-01-03 18:23:43.677420",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent conflated the factual occurrence of a formal action with the perceived intent or seriousness of its subject. It mandates that when verifying claims about formal actions, the focus must be on whether the action factually occurred, independent of judgments about the action's underlying context, intent, or satirical nature, unless such qualifiers are explicitly part of the claim. This prevents false positives by ensuring a literal interpretation of claims regarding formal actions.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00011",
      "type": "strategy",
      "condition": "When a claim involves specific verbatim textual elements or direct quotations, and rules requiring high-precision verification (e.g., shr-00002, shr-00005) are active, AND raw search responses are available.",
      "action": "Prioritize thorough parsing of `raw_search_responses` to identify and extract the most complete, exact verbatim quote and its immediate contextual sentences, explicitly bypassing or supplementing any AI summaries. This precise textual evidence must be explicitly included as a primary item in the `evidence` list with source citations. Furthermore, this precise evidence must be directly integrated into the `reasoning` to justify the verdict regarding the verbatim claim. Additionally, all temporal elements related to the claim must be cross-referenced across sources, and any discrepancies in date precision must be explicitly noted or resolved within the reasoning.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20240726_100000",
      "created_at": "2026-01-03 18:24:49.474505",
      "parent_rule": null,
      "description": "This rule addresses a critical operational gap in verbatim claim verification. It mandates that when specific quotes are central to a claim, the agent must directly extract the full, exact quote and its context from `raw_search_responses` (e.g., source documents, articles) rather than relying solely on AI-generated summaries. This extracted, precise evidence must be explicitly listed and used in the reasoning to ensure accurate and complete verification, preventing conclusions based on potentially imprecise or incomplete summaries. It also requires careful comparison and notation of temporal precision across all gathered evidence.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00012",
      "type": "strategy",
      "condition": "IF a claim involves a direct verbatim quote, AND an original primary source (e.g., video recording, audio, official transcript, or original publication) containing the quote is discoverable, AND this primary source offers greater precision or directness than secondary sources already found.",
      "action": "THEN the system must actively search for and prioritize citing this original primary source with specific contextual details (e.g., timestamp, specific document section, page number, or direct URL) in the final reasoning and evidence chain. This prioritization should occur even when secondary sources have already confirmed the quote, to maximize evidence strength and verifiability.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240523_100000",
      "created_at": "2026-01-03 18:27:20.464671",
      "parent_rule": null,
      "description": "This rule addresses an opportunity to elevate the standard of evidence for claims involving direct verbatim quotes. It mandates actively seeking and prioritizing original primary sources (e.g., video recordings, official transcripts, original publications) over secondary reports for citation, especially when they offer superior precision or directness. This ensures the strongest possible evidence chain by requiring explicit referencing of primary sources with specific details (e.g., timestamp, document section) in the reasoning, thereby enhancing the rigor and trustworthiness of the verification process.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00013",
      "type": "strategy",
      "condition": "IF a claim involves a direct verbatim quote AND the quote is identified as sensitive (e.g., controversial, high-impact, or potentially misattributed),",
      "action": "THEN the evidence retrieval process must explicitly prioritize searching for and citing primary media sources (e.g., video or audio recordings) that include specific timestamps for the quote, OR detailed analyses from highly reputable fact-checking organizations that explicitly provide such primary source verification. This evidence must be highlighted as critical for 'trust' in the claim's verification.",
      "confidence": 0.92,
      "evidence_count": 1,
      "created_from": "case_20240726_120000",
      "created_at": "2026-01-03 18:29:35.709058",
      "parent_rule": "shr-00012",
      "description": "This rule refines the standard of evidence for verbatim quotes, specifically for sensitive claims. It mandates a heightened focus on tracing sensitive verbatim quotes back to their most direct primary media source (e.g., video/audio with timestamps) or highly reputable fact-checking analyses that provide such granular primary source verification. This ensures the strongest possible grounding for the authenticity and context of the quote, preventing insufficient evidence for high-stakes 'trust' claims.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00014",
      "type": "strategy",
      "condition": "IF a claim contains a specific date or temporal reference (e.g., 'late 2025', 'October 31, 2025') that defines the timing of the asserted event, AND the system is determining the temporal context of this event relative to the current execution timestamp.",
      "action": "THEN the system must accurately compare the claim's date with the current execution timestamp. Explicitly identify and record whether the event is in the past, present, or future. This temporal classification must be integrated into the initial probability assessment and clearly documented in the `analysis_notes` to prevent mischaracterization of temporal context and ensure subsequent verification steps are appropriately framed.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20231027_123456",
      "created_at": "2026-01-03 18:31:58.700204",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to accurately establish the temporal relationship of a claim's event to the current execution timestamp. It mandates a precise comparison of any explicit or implied claim dates with the system's current time, ensuring correct classification of the event as past, present, or future. This prevents initial mischaracterizations that could misguide the verification process and ensures accurate contextualization for all subsequent analysis.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00017",
      "type": "strategy",
      "condition": "IF a claim contains an explicit or implied date or temporal reference, AND the agent needs to establish its relationship to the current verification time.",
      "action": "THEN the agent MUST directly and unambiguously compare the claimed date against the provided `execution_timestamp` from the agent's environment. IF the claimed date precedes the `execution_timestamp`, the event is classified as past. IF the claimed date is after the `execution_timestamp`, the event is classified as future. The agent MUST NOT rely on generalized assumptions, heuristics, or inferred 'current year' for temporal classification, but strictly use the `execution_timestamp` for all such comparisons, and explicitly state this comparison in its reasoning.",
      "confidence": 0.92,
      "evidence_count": 1,
      "created_from": "case_20240515_120000",
      "created_at": "2026-01-03 18:35:43.841378",
      "parent_rule": "shr-00014",
      "description": "This rule refines `shr-00014` by mandating a strict, direct, and unambiguous chronological comparison of any claimed event date or temporal reference against the `execution_timestamp` provided in the agent's environment. It explicitly forbids the use of generalized assumptions or heuristics for temporal classification, ensuring accurate determination of an event's past, present, or future status. This prevents critical reasoning errors such as misinterpreting verb tenses, generating unwarranted perceptions of 'unusual temporal framing,' or leading to flawed confidence explanations based on incorrect temporal context.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00018",
      "type": "strategy",
      "condition": "The claim contains a specific numerical value presented as a 'potential' or 'estimated' financial figure, particularly when evaluating the claim for 'trust'.",
      "action": "The agent must critically assess the origin, methodology, and public verifiability of the estimate, beyond merely confirming its mention. If the figure is attributed to vague sources (e.g., 'unnamed analysts', 'legal analyses suggest') or lacks documented substantiation for its derivation, the reasoning MUST explicitly highlight this lack of concrete evidence and its implications for the claim's validity, regardless of any cautious phrasing in the claim.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20240728_120000",
      "created_at": "2026-01-03 18:42:02.282868",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to adequately scrutinize the basis of 'potential' or 'estimated' financial figures, accepting their mere mention as sufficient support. It mandates a rigorous assessment of the origin, methodology, and public verifiability for such numerical estimates, requiring the agent to explicitly note when figures lack concrete substantiation from vague or undocumented sources, thereby preventing unwarranted trust in weakly supported numerical claims.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00019",
      "type": "strategy",
      "condition": "When evaluating a claim with a specific event date, and the agent has performed a direct chronological comparison of the claimed event date against the `execution_timestamp` (as mandated by `shr-00017`), AND conflicting temporal information is encountered in collected evidence (e.g., some sources describe the event as future, others as past, or AI summaries provide incorrect temporal assessments).",
      "action": "The determination of the event's temporal status (past, present, or future) based on the strict comparison with the `execution_timestamp` must take absolute precedence over any conflicting temporal information found in external evidence. Any external evidence that contradicts this internal temporal classification must be flagged as potentially erroneous or hallucinatory. Subsequent verification steps, including confirming the actualization of projected roles or conditions, must proceed based on the `execution_timestamp`'s definitive temporal context.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240523_103000",
      "created_at": "2026-01-03 18:43:39.911144",
      "parent_rule": "shr-00017",
      "description": "This rule refines `shr-00017` by explicitly mandating that the agent's internal, direct chronological comparison of a claimed event date against the `execution_timestamp` takes absolute precedence over any conflicting temporal assessments found in external evidence. It ensures that the system's own clock is the definitive source for establishing temporal context, preventing false positives caused by misinterpreting or being misled by inaccurate or hallucinatory temporal information from external sources, and guiding subsequent verification based on the correct temporal frame.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00020",
      "type": "strategy",
      "condition": "When performing any temporal assessment or comparison, or when establishing the temporal context for a claim (e.g., classifying an event as past, present, or future).",
      "action": "The agent MUST explicitly identify and consistently use its *actual* `execution_timestamp` (as provided by the environment) as the sole, non-negotiable reference point for all temporal comparisons. It must never generate or assume a hypothetical `execution_timestamp` that deviates from the actual system time. All subsequent temporal rules (e.g., `shr-00014`, `shr-00017`, `shr-00019`) must operate using this definitive `execution_timestamp` to ensure accurate chronological framing.",
      "confidence": 0.95,
      "evidence_count": 1,
      "created_from": "case_20240515_120000",
      "created_at": "2026-01-03 18:46:24.955092",
      "parent_rule": null,
      "description": "This rule addresses a critical internal inconsistency where the agent might use an assumed or hypothetical `execution_timestamp` instead of its actual system `timestamp`. It mandates that the agent's *actual* `execution_timestamp`, as provided by its environment, must be the sole and consistent reference point for all temporal reasoning and comparisons. This prevents fundamental errors in classifying events as past, present, or future, ensuring the integrity of subsequent temporal verification rules and preventing false positives due to incorrect temporal context.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00022",
      "type": "strategy",
      "condition": "IF a claim contains subjective terms implying significant magnitude, proportion, or primary influence (e.g., 'bankrolling', 'major contributor', 'primary funder', 'largely responsible') AND the core assertion of the claim is found to be factually true",
      "action": "THEN the agent must actively seek and integrate comparative contextual data (e.g., total funds, other significant contributors, relative market share, scale of impact) to assess the *degree*, *proportion*, or *significance* of the asserted influence or contribution. The reasoning must explicitly articulate this nuanced assessment, highlighting any limitations, contextual factors, or the relative importance of the asserted element within the broader context, even if the overall claim's truth value remains unchanged.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20240728_100000",
      "created_at": "2026-01-03 18:49:52.467849",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to provide a sufficiently nuanced and comprehensive analysis of subjective terms implying magnitude or primary influence. It mandates that when such claims are found to be factually true, the agent must actively seek and integrate comparative contextual data to assess the *degree* or *proportion* of the asserted influence, thereby providing a more complete and rigorous evaluation of the claim's full implications and preventing superficial 'True' assessments.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00023",
      "type": "strategy",
      "condition": "IF a claim contains a specific date (e.g., 'September 2025') AND the agent's internal temporal comparison initially classifies this date as being in the future relative to the `execution_timestamp` (e.g., '2026-01-03') AND multiple high-credibility external sources (e.g., grounded AI summaries, reputable news archives) consistently present events associated with this date as having already occurred in the past.",
      "action": "THEN trigger a critical temporal discrepancy alert, re-evaluate the internal temporal classification for this specific instance, and prioritize the consistent external evidence indicating a past event. This re-evaluation must confirm the correct temporal context before applying rules that dismiss evidence based on the event being in the future (e.g., `shr-00019`).",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240516_120000",
      "created_at": "2026-01-03 18:52:42.646922",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning flaw where the agent's internal temporal classification (e.g., misidentifying a past date as future) leads to the erroneous dismissal of valid external evidence. It mandates a re-evaluation of the internal temporal classification when strong, consistent, high-credibility external sources contradict the agent's initial 'future' assessment, ensuring that subsequent temporal verification rules are applied within the correct historical context.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00024",
      "type": "strategy",
      "condition": "IF a claim contains components (e.g., roles, events) explicitly dated in the future relative to the `execution_timestamp` OR if initial verification for named individuals in the claim yields no support or indicates misattribution for the relevant period.",
      "action": "THEN, for future-dated components, adjust the temporal context for verification to their stated future period, proactively searching for evidence relevant to that future context. Simultaneously, if individuals are misattributed or unsubstantiated, broaden search queries to verify the core action or event by including relevant organizations or general event descriptions, prioritizing the factual occurrence of the event over exact individual attribution.",
      "confidence": 0.95,
      "evidence_count": 1,
      "created_from": "case_20240607_120000",
      "created_at": "2026-01-03 18:54:12.339727",
      "parent_rule": null,
      "description": "This rule addresses critical false positives by enhancing temporal reasoning and search strategy. It mandates adjusting the verification timeframe for future-dated claim components and broadening search scope for core actions/events when named individuals are misattributed, ensuring a more flexible and robust verification process for complex claims, especially those with future temporal references or minor attribution inaccuracies.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00025",
      "type": "strategy",
      "condition": "When a claim involves broad demographic terms (e.g., 'children', 'youth', 'elderly') within a specific domain (e.g., public health, statistics, legal), and the accurate interpretation of the claim's scope hinges on the precise definition or segmentation of these terms within that domain.",
      "action": "1. Proactively identify if the claim uses a broad demographic term whose scope might be context-dependent. 2. Execute targeted searches to investigate how this term is typically defined or segmented within the specific domain or context relevant to the claim (e.g., 'definition of 'children' in [specific country/state] child mortality statistics', 'age groups for 'youth' in [specific organization] reports'). 3. Prioritize authoritative sources (e.g., official statistical bodies, public health organizations, legal texts) for these definitions. 4. If credible domain-specific definitions or common exclusions (e.g., infants from 'child' mortality data due to distinct causes) are found, apply this contextual interpretation to determine the precise scope of the claim before rendering a final verdict. 5. Explicitly state the identified domain-specific definition and how it impacts the claim's scope in the reasoning.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20240729_120000",
      "created_at": "2026-01-03 18:56:43.336614",
      "parent_rule": "shr-00022",
      "description": "This rule refines `shr-00022` by mandating that when claims involve broad demographic terms within specific domains (e.g., public health, statistics), the agent must actively investigate and prioritize domain-specific definitions, standard age-group segmentations, and common research practices. This prevents misinterpretations arising from applying a universal definition where a nuanced, contextual one is required, ensuring accurate scope assessment before verification and preventing false positives.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00029",
      "type": "strategy",
      "condition": "When a claim includes a relative temporal modifier (e.g., 'recently', 'lately', 'in recent years') and a plausible implied original context timestamp for the claim can be identified or inferred.",
      "action": "The agent must evaluate evidence for its recency and relevance primarily against this inferred or identified claim context timestamp. If evidence is dated significantly *after* the claim's implied context (i.e., appears futuristic from the claim's original perspective), this temporal discrepancy must be explicitly flagged and investigated. The agent must determine if the evidence is still relevant to the claim's *current* assessment, or if the claim itself has evolved, ensuring that the `execution_timestamp` is used for the *current verification moment* while respecting the claim's *original temporal framing*.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20240520_120000",
      "created_at": "2026-01-03 19:03:29.988496",
      "parent_rule": null,
      "description": "This rule addresses a critical temporal reasoning gap where the agent failed to differentiate between its `execution_timestamp` and the implied context timestamp of a claim containing relative temporal modifiers. It mandates evaluating evidence for recency against the claim's inferred original context and flagging temporal discrepancies where evidence is futuristic relative to that context, preventing misinterpretations of relevance.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00030",
      "type": "strategy",
      "condition": "IF a claim asserts a direct verbatim quote, AND the agent is evaluating evidence for its authenticity and precision.",
      "action": "THEN the agent must prioritize and actively seek evidence that provides the most exact verbatim match from primary sources. If only semantically equivalent but not precisely verbatim phrasing is found, the agent must explicitly note this discrepancy in the reasoning, articulate the degree of similarity, and justify why the semantically equivalent evidence is sufficient (or insufficient) to confirm the claim. AI summaries or paraphrased texts must not be used as primary confirmation for the verbatim accuracy of a direct quote claim, even if they capture the semantic meaning.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20240726_120000",
      "created_at": "2026-01-03 19:05:54.507516",
      "parent_rule": null,
      "description": "This rule addresses a critical gap in verbatim quote verification by mandating explicit differentiation between exact verbatim matches and semantically equivalent phrasing. It requires the agent to prioritize primary source extraction for direct quotes and, when exact matches are unavailable, to transparently document any discrepancies and justify the use of semantically similar evidence, thereby enhancing the precision and rigor of evidence assessment for 'trust' claims. It also reinforces the prohibition against using AI summaries for verbatim confirmation.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00031",
      "type": "strategy",
      "condition": "IF the agent is evaluating textual evidence (e.g., AI summary, article snippet) from a highly credible source, AND this evidence contains both a general statement or initial assessment about the claim (e.g., 'inaccurate', 'false') AND subsequent, more specific details that confirm or clarify a component of the claim (e.g., specific date, quote authenticity, circulation details).",
      "action": "The agent MUST prioritize and integrate the specific confirming or clarifying details, even if they appear to contradict the initial general statement. The specific details MUST be used to refine or override the general assessment for the relevant claim components, ensuring a holistic and nuanced interpretation of the evidence. The agent must explicitly articulate how the specific details inform the overall assessment of the claim's components, overriding any preceding general 'inaccurate' label for the overall claim's initial presentation.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240523_120000",
      "created_at": "2026-01-03 19:07:44.639669",
      "parent_rule": null,
      "description": "This rule addresses a critical evidence interpretation gap by mandating that when highly credible textual evidence presents both general statements and specific confirming details, the agent must prioritize and synthesize the specific details to achieve a nuanced and accurate assessment, preventing premature conclusions based on general summaries alone and ensuring explicit articulation of how specific details refine or override general assessments.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00032",
      "type": "strategy",
      "condition": "IF a claim asserts a 'current' status, role, or state, or uses similar present-tense temporal indicators (e.g., 'currently holds', 'is', 'remains'), and this status is tied to an event with a specific date (e.g., an assumption date, an effective date) that defines its inception or duration.",
      "action": "THEN the system MUST explicitly retrieve and utilize the actual `execution_timestamp` for comparison. It must perform a precise chronological comparison: IF the event's defining date is on or before the `execution_timestamp`, the 'current' status aspect of the claim is assessed as True. IF the event's defining date is after the `execution_timestamp`, the 'current' status aspect of the claim is assessed as False. This explicit comparison must take precedence over any implicit assumptions or conflicting external temporal assessments, reinforcing the principles of `shr-00017`, `shr-00019`, and `shr-00020`.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240502_103000",
      "created_at": "2026-01-03 19:09:30.929744",
      "parent_rule": null,
      "description": "This rule addresses a critical false positive where the agent failed to correctly apply temporal reasoning for 'current status' claims. It mandates explicit retrieval and comparison of the event's defining date against the actual `execution_timestamp`, preventing incorrect assumptions about temporal context and ensuring accurate assessment of present-tense claims. It reinforces the principles of `shr-00017`, `shr-00019`, and `shr-00020` for specific 'current status' verification.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00034",
      "type": "strategy",
      "condition": "When the investigation, informed by temporal analysis (e.g., through rules like `shr-00017`, `shr-00019`, `shr-00032`), uncovers specific temporal context that clarifies or directly contradicts an implied causal relationship or a common understanding of event sequencing associated with the claim.",
      "action": "The final reasoning MUST explicitly articulate this temporal/causal context, clarifying any potential misinterpretations or implied causal links, thereby ensuring a complete, nuanced, and accurate understanding of the claim in its broader context, even if the literal claim is factually correct.",
      "confidence": 0.8,
      "evidence_count": 1,
      "created_from": "case_20240523_100000",
      "created_at": "2026-01-03 19:12:36.420121",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to integrate crucial temporal and implied causal context into its final explanation, leading to potential misinterpretation of factually correct claims. It mandates that when investigation reveals temporal or causal relationships that clarify or contradict common understandings or implied narratives surrounding a claim, this context must be explicitly articulated in the final reasoning. This ensures that the fact-check provides a comprehensive, nuanced, and accurate assessment, preventing misleading conclusions based on incomplete contextualization.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00035",
      "type": "strategy",
      "condition": "IF a claim involves a quantitative superlative (e.g., 'lowest ever', 'highest ever', 'most', 'least') for a specific demographic group (e.g., 'men', 'women', 'youth') AND the quantitative term used (e.g., 'rate', 'attainment', 'percentage', 'share', 'representation') is ambiguous and could reasonably be interpreted as either an absolute value (e.g., total count, raw percentage increase/decrease) OR a proportional share/representation within a larger context (e.g., percentage of a total, relative to another group's rate).",
      "action": "THEN the system must explicitly formulate search queries and evaluate evidence for both interpretations. It must prioritize and weigh heavily evidence that clarifies the demographic group's *proportional share* or *representation* if such evidence directly aligns with and substantiates the claim's superlative assertion (e.g., confirming 'lowest share on record'). If evidence for the proportional share interpretation strongly supports the superlative, this interpretation should take precedence, especially when raw search results contain direct clarifying phrases (e.g., 'share declined to lowest on record').",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240523_120000",
      "created_at": "2026-01-03 19:13:45.621858",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to correctly interpret ambiguous quantitative terms (e.g., 'rate', 'attainment') in claims involving superlatives (e.g., 'lowest ever') for specific demographic groups. It mandates actively exploring both absolute value and proportional share interpretations, prioritizing the proportional share when it aligns with the superlative's relative meaning and is supported by direct evidence (e.g., 'lowest share on record'). This prevents false positives caused by misinterpreting the claim's core intent by focusing solely on absolute numbers when a relative proportion is implied.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00038",
      "type": "strategy",
      "condition": "When a claim contains an explicit or implied date or temporal reference, and the `execution_timestamp` is available to the agent.",
      "action": "The agent must perform a strictly accurate, explicit, and unambiguous chronological comparison between the claim's event date and the `execution_timestamp`. The resulting temporal classification (past, present, or future) must be demonstrably and fundamentally correct, especially across year boundaries (e.g., correctly identifying an event in 2025 as being in the past relative to an `execution_timestamp` in 2026). This accurate foundational temporal classification must be explicitly stated in the reasoning and serve as the immutable basis for the application of all subsequent temporal reasoning rules (e.g., shr-00014, shr-00017, shr-00019, shr-00020, shr-00032).",
      "confidence": 0.92,
      "evidence_count": 1,
      "created_from": "case_20240520_120000",
      "created_at": "2026-01-03 19:19:56.145535",
      "parent_rule": null,
      "description": "This rule addresses a critical, foundational error in temporal comparison logic that led to false positives by misclassifying past events as future. It mandates a strictly accurate, explicit, and unambiguous chronological comparison between any claimed event date and the `execution_timestamp`. The agent *must explicitly log* the precise outcome of this comparison (e.g., 'execution_timestamp is AFTER event_date') to ensure the resulting temporal classification (past, present, or future) is fundamentally correct (e.g., year 2025 is correctly identified as being before year 2026 when the `execution_timestamp` is 2026). This accurate foundational classification is paramount, serving as the definitive basis for establishing the claim's temporal truth status, and must precede and inform the application of all other temporal reasoning rules.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00039",
      "type": "strategy",
      "condition": "IF a claim asserts a superlative financial contribution from entity A to entity B for a specific purpose C, AND the contribution mechanism involves a general fund (e.g., federal taxes, general revenue), AND the claim also contains ambiguous quantitative terms or superlatives (e.g., 'top donor', 'lowest ever').",
      "action": "1) Explicitly investigate and state whether the financial contribution to purpose C from A is directly traceable or if it's via commingled funds. 2) Explain the implications of this traceability (or lack thereof) on the claim's accuracy, especially regarding any implied direct causal links. 3) Ensure a comprehensive comparison of both absolute and per capita metrics, discussing their relevance to the claim's phrasing and providing a balanced assessment.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240523_103000",
      "created_at": "2026-01-03 19:21:19.584968",
      "parent_rule": "shr-00035",
      "description": "This rule refines `shr-00035` by addressing a critical reasoning gap in claims asserting superlative financial contributions, particularly when general or commingled funds are involved. It mandates a rigorous investigation into the directness and traceability of the financial contribution to a stated specific purpose, and an explicit explanation of the implications of this traceability (or lack thereof) on the claim's accuracy, especially regarding implied causal links. Furthermore, it requires a comprehensive and balanced analysis of both absolute and per capita metrics when evaluating such superlative financial claims, ensuring their respective implications are acknowledged rather than one being dismissed.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00040",
      "type": "strategy",
      "condition": "IF a claim makes a comparative statement about the size or magnitude of entities (e.g., 'largest', 'bigger than', 'most significant') without explicitly specifying the metric (e.g., personnel, budget, scope of operations).",
      "action": "The agent must:\n1. Actively identify and evaluate the claim against *all plausible metrics* for size/magnitude (e.g., personnel count, budget, scope of operations) that are supported by the available evidence.\n2. Ensure comprehensive extraction and utilization of *all relevant numerical data* for all entities mentioned in the comparison, drawing from *all components* of the `investigator_output`, including raw search responses, not just summarized cited segments.\n3. For compound claims, if the claim holds true under at least one reasonable interpretation or metric supported by evidence, the verdict should reflect this (e.g., 'True' or 'Mostly True'), rather than a definitive 'False' based on a single, potentially incomplete, interpretation.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240726_120000",
      "created_at": "2026-01-03 19:24:13.200361",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to comprehensively evaluate comparative claims (e.g., 'largest', 'bigger than') lacking an explicit metric. It mandates identifying and assessing the claim against all plausible metrics supported by evidence (e.g., personnel, budget) and ensuring comprehensive extraction of all relevant numerical data from *all parts* of the `investigator_output`, including raw search responses. Furthermore, for compound claims, if the claim holds true under at least one reasonable interpretation or metric, the verdict should lean towards 'True' or 'Mostly True' to prevent false positives based on narrow interpretation.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00041",
      "type": "strategy",
      "condition": "IF a claim is found to be literally true AND the collected evidence (e.g., AI Summary, cited segments, search results) indicates that the claim has been widely misinterpreted, is frequently misunderstood, or has gained traction due to a lack of crucial context (e.g., mistaken as a prediction, misapplication of terms, omission of historical context).",
      "action": "THEN the reasoning MUST explicitly incorporate this contextual information, proactively clarify ambiguous terms, address potential misunderstandings, and debunk common fallacies or misinterpretations associated with the claim. The fact-check should provide a comprehensive and unambiguous picture, leveraging all relevant contextual information gathered during the investigation.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240723_100000",
      "created_at": "2026-01-03 19:25:27.127043",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to provide comprehensive context for claims that are literally true but widely misinterpreted or misleading. It mandates that when a claim is found to be factually correct, but evidence indicates common misunderstandings or a lack of crucial context (e.g., from AI summaries, cited segments, or search results), the agent must explicitly integrate this contextual information into its reasoning. This includes clarifying ambiguous terms, addressing potential misinterpretations, and actively debunking common fallacies to ensure the fact-check is comprehensive, unambiguous, and effectively counters misinformation, even for literally true claims.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00042",
      "type": "strategy",
      "condition": "The claim asserts a long-term policy impact based on existing legislation or official pronouncement, often characterized by a specific or colloquial extended duration, AND the claim has been factually verified as 'True'.",
      "action": "The agent must explicitly integrate into its reasoning: 1) an explanation of the practical mechanisms, underlying factors, or incentives (e.g., economic, structural, lack of alternatives) that make the asserted long-term impact highly probable, effectively 'locked-in,' or likely to be utilized; AND 2) a clear articulation of any inherent contingencies, legal pathways, or possibilities for future legislative, judicial, or policy changes that could realistically modify, repeal, or terminate the stated long-term effect, thereby providing a comprehensive assessment of its durability and real-world implications.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240729_120000",
      "created_at": "2026-01-03 19:26:46.228700",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to provide a comprehensive analysis of long-term policy claims, even when factually true. It mandates that for claims asserting long-term policy impacts, especially those with colloquial durations, the reasoning must explicitly cover both the practical likelihood and underlying mechanisms of the impact's occurrence, as well as potential future contingencies (legislative, judicial, or policy changes) that could alter or terminate the stated effect. This ensures a nuanced, complete, and less misleading assessment of the claim's durability and real-world implications.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00044",
      "type": "strategy",
      "condition": "IF a claim's core veracity relies on the existence of a specific verbatim quote from a document, AND an initial search result (especially an AI summary or any non-primary source summary) provides a definitive negative statement about the quote's existence or authenticity,",
      "action": "THEN the agent must initiate a mandatory, high-priority verification process. This process requires immediate targeted searches for the primary source document (e.g., official releases, archival records, original publications) or corroboration from at least two highly credible, independent fact-checking organizations known for detailed document analysis. The objective of these searches must be to explicitly *confirm* the quote's existence and exact wording, or to provide definitive, verifiable evidence that *explicitly debunks* the quote from an authoritative source. The agent must never accept a general negative assertion from an AI summary or secondary source as conclusive evidence for such critical claim elements without this escalated primary source verification.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240523_100000",
      "created_at": "2026-01-03 19:32:47.715604",
      "parent_rule": "shr-00011",
      "description": "This rule refines `shr-00011` by addressing a critical false positive where the agent over-relied on definitive negative assertions from AI summaries or secondary sources regarding the existence of critical verbatim quotes. It mandates a mandatory, high-priority escalation to direct primary source verification or cross-referencing with multiple highly credible fact-checkers when such negative assertions are encountered for quotes central to a claim's veracity. This prevents premature negative conclusions based on incomplete or unreliable summaries and ensures a robust investigation into the actual existence or non-existence of the verbatim quote.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00048",
      "type": "strategy",
      "condition": "When evaluating numerical claims that compare financial contributions (e.g., 'taxes paid', 'revenue', 'profits') across different types of entities (e.g., individuals, corporations, sectors, countries).",
      "action": "The agent must explicitly define the specific financial metrics being compared for each entity (e.g., 'federal income tax', 'global taxes borne', 'state and local taxes'). It must then consistently apply these definitions throughout the comparison. If a direct 'apples-to-apples' comparison is not perfectly achievable due to data limitations or inherent differences, the reasoning must explicitly state the differing definitions used for each component and clearly articulate any limitations or caveats of the comparison, ensuring a nuanced and accurate assessment of the claim's validity.",
      "confidence": 0.88,
      "evidence_count": 1,
      "created_from": "case_20240729_120000",
      "created_at": "2026-01-03 19:45:37.938384",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap in numerical comparative claims involving financial contributions across different entity types. It mandates explicit definition and consistent application of financial metrics, and transparently stating limitations if an 'apples-to-apples' comparison is not achievable, thereby ensuring rigorous, nuanced, and accurate financial assessments by preventing misleading comparisons.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00053",
      "type": "strategy",
      "condition": "IF a claim asserts facts or events about a specific future date or timeframe, AND the agent's internal temporal classification (as per shr-00024, shr-00038) places the execution_timestamp prior to this asserted future date/timeframe, AND credible evidence (especially from 'raw_search_responses') explicitly reports these future events or statuses (e.g., presidencies, project costs, construction timelines, policy implementations, government shutdowns) as planned, expected, or projected facts for that date/timeframe,",
      "action": "THEN the agent must: 1. Treat these reported future facts as verifiable components of the claim within their stated future context, rather than dismissing them solely as unconfirmed predictions. 2. Ensure all sub-claims and individual components are verified against the most detailed and granular information available within the complete 'raw_search_responses', explicitly avoiding over-reliance on AI summaries or partial evidence. 3. Mandate that all relevant search queries generated by the 'planner_output' for verifying these future components are consistently executed by the 'investigator_output'; any decision to skip a planned query must be explicitly justified and documented within the 'process_trace'. 4. Prioritize evidence that outlines the official planning, expectation, or projection of these future facts from authoritative sources.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240101_120000",
      "created_at": "2026-01-03 19:53:50.467157",
      "parent_rule": "shr-00024",
      "description": "This rule refines `shr-00024` by addressing a critical false positive where the agent failed to correctly interpret and verify claims asserting 'reported future facts'. It mandates that when a claim refers to specific future events or statuses, and credible evidence (even from a current `execution_timestamp`) reports these as planned, expected, or projected facts, the agent must treat them as verifiable components. Furthermore, it reinforces the necessity of thorough evidence extraction from `raw_search_responses` and ensures the execution of all critical search queries to comprehensively verify these future-oriented claims, preventing premature dismissal based on rigid temporal interpretation or incomplete evidence.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00057",
      "type": "strategy",
      "condition": "When a claim refers to a specific event or status slated for a future date (relative to the `execution_timestamp`), AND collected evidence consistently and within its own narrative context describes this event as having already occurred at or after that specified future date.",
      "action": "The claim asserting the *reporting* or *occurrence within the evidence's narrative* of the event should be assessed as 'True' or 'Mostly True' based on its internal consistency within the evidence. Concurrently, a separate flag or explicit note must be generated in the reasoning to highlight the temporal discrepancy between the `execution_timestamp` and the evidence's narrative, explicitly stating that the event is reported as completed even though its claimed date is in the future relative to the `execution_timestamp`, indicating potential fabrication or hallucination *in the evidence itself*.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240510_120000",
      "created_at": "2026-01-03 20:04:21.106843",
      "parent_rule": "shr-00053",
      "description": "This rule refines `shr-00053` by addressing a critical false positive where the agent failed to differentiate between the real-world temporal truth and the internal narrative consistency of evidence, especially for claims about future events. It mandates that when a claim specifies a future event, and the retrieved evidence consistently reports this event as having *already occurred* within its own narrative, the claim's assertion of this reporting should be considered 'True'. This prevents incorrect 'False' verdicts by prioritizing the internal consistency of the presented narrative while simultaneously requiring the agent to flag any temporal discrepancies (e.g., future event reported as past) as potential indicators of fabricated or hallucinatory evidence, thereby ensuring a nuanced and comprehensive assessment.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00061",
      "type": "strategy",
      "condition": "When evaluating a claim that involves a numerical comparison between multiple entities (e.g., 'X is greater than Y', 'Z has the highest rate'), and specific, direct numerical data for *each* of those compared entities is explicitly present within the *complete* `raw_search_responses` content, even if not fully surfaced in `evidence_items` or AI summaries.",
      "action": "The `judge_reasoning` module must explicitly extract and prioritize these direct, specific numerical figures from the `raw_search_responses` for all compared entities. It must perform a direct, data-driven comparison using these figures and *not* rely on implied statements, general trends, or truncated AI summaries from `evidence_items` if the comprehensive raw data is available. Ensure all sub-claims of a compound comparative claim are verified with this most granular and direct numerical evidence found.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240510_120000",
      "created_at": "2026-01-03 20:12:03.646231",
      "parent_rule": "shr-00040",
      "description": "This rule refines `shr-00040` by addressing a critical reasoning gap where the agent failed to thoroughly extract and prioritize specific numerical data from `raw_search_responses` for comparative claims. It mandates direct, data-driven comparison using the most granular numerical evidence available in the full search results, explicitly prohibiting reliance on truncated summaries or implied trends when precise data is present, thereby ensuring rigorous assessment of comparative numerical claims.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00062",
      "type": "strategy",
      "condition": "IF a claim describes a specific event involving a person's future role or status (e.g., 'X will be Y') AND the event's implied or stated temporal context is in the future relative to the current `execution_timestamp`.",
      "action": "THEN the agent must first infer and establish this future temporal context (the event's date/time) as the primary reference frame for verifying all related sub-claims and collecting evidence. All subsequent temporal comparisons for these sub-components (e.g., via `shr-00038`) must explicitly use this inferred future event date as the 'claimed event date', rather than solely the `execution_timestamp`. This also mandates enhancing search queries to explicitly include the inferred future dates for event-specific searches (e.g., 'George Stephanopoulos JD Vance interview October 2025').",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240726_120000",
      "created_at": "2026-01-03 20:13:34.768894",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to correctly establish the temporal frame of reference for claims describing future events involving future roles or statuses. It mandates that when such claims are encountered, the agent must infer and use the event's implied or stated future temporal context as the primary reference for verification, ensuring that all sub-claims and evidence collection are evaluated within the correct future timeframe, thereby preventing false positives caused by rigid application of the current `execution_timestamp`.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00063",
      "type": "strategy",
      "condition": "IF a claim involves evaluating trends over a specific tenure or period (e.g., 'during X's tenure', 'between year A and year B'), AND relevant numerical or statistical data across that period is available in the investigator_output.",
      "action": "THEN the agent's reasoning MUST comprehensively analyze data across the *entire* specified timeframe, including all relevant years and known fluctuations (increases, decreases, plateaus). The reasoning must explicitly compare key metrics year-over-year within the tenure and against prior periods (if relevant for context), and integrate relevant geographical variations. The final justification MUST reflect a complete contextual understanding of the entire period and all gathered evidence, avoiding oversimplification by focusing solely on initial data points or isolated statistics when the overall trend is more complex.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240516_120000",
      "created_at": "2026-01-03 20:15:19.674029",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to comprehensively analyze claims involving trends over a specified period (e.g., a governor's tenure). It mandates a thorough temporal and geographical analysis of *all* available data within the claimed period, explicitly integrating year-over-year fluctuations and regional variations. This ensures a nuanced, complete, and balanced justification for the verdict, preventing oversimplification and selective highlighting of evidence, thereby complementing existing rules for comprehensive analysis (e.g., shr-00009, shr-00022, shr-00040, shr-00041) by providing specific guidance for trend analysis.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00065",
      "type": "strategy",
      "condition": "IF a claim involves a quantified figure (e.g., financial sums, legal restitutions, statistical data), AND the supporting evidence for that figure (or a substantial part of it) uses explicit qualifiers indicating estimation, pending status, or lack of finalization (e.g., 'estimated', 'pending', 'could have erased', 'speculative', 'not yet formally approved'),",
      "action": "THEN the reasoning MUST explicitly state these qualifiers, explain the provisional or estimated nature of the figure, detail the implications of this uncertainty on the claim's factual status, and adjust the overall confidence level to reflect the inherent uncertainty, thereby preventing overconfident assertions based on provisional or unfinalized data.",
      "confidence": 0.88,
      "evidence_count": 1,
      "created_from": "case_20240728_120000",
      "created_at": "2026-01-03 20:18:56.631358",
      "parent_rule": "shr-00018",
      "description": "This rule refines `shr-00018` by mandating a highly granular and explicit handling of numerical claims supported by provisional or estimated evidence. It requires the agent to not only identify but also explicitly articulate qualifiers (e.g., 'estimated', 'pending', 'could have erased'), explain the provisional nature of the figures, and integrate this uncertainty into the confidence assessment. This prevents overconfident assertions and ensures a nuanced understanding of numerical claims when evidence indicates a lack of finalization or full certainty, addressing a critical gap in interpreting numerical precision and certainty.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00066",
      "type": "strategy",
      "condition": "IF a claim involves visual media, particularly historical or widely circulated images, AND the verification aims to establish its comprehensive truth status (beyond mere authenticity/fabrication).",
      "action": "The agent must:\n1. Prioritize search queries to identify the original publication source and the detailed narrative of the image's discovery or initial circulation.\n2. Conduct targeted searches for common associated sub-claims, rumors, or widespread interpretations related to the visual media and explicitly address their veracity and context in the reasoning.\n3. If an original or primary source for the visual media is identified, include an explicit evaluation of its specific credibility and how its content directly substantiates, refutes, or contextualizes the claim, going beyond reliance on general aggregators for initial confirmation.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240508_120000",
      "created_at": "2026-01-03 20:20:29.388486",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to conduct a comprehensive fact-check for claims involving visual media, especially historical or viral images, by overlooking their specific origin, discovery narrative, and associated rumors. It mandates a deeper investigation beyond mere authenticity, requiring the identification of original sources, proactive debunking of related sub-claims, and a nuanced assessment of primary source credibility. This ensures a more robust, contextualized, and complete verification for such complex visual claims, complementing existing visual media rules (e.g., shr-00050, shr-00054, shr-00056) and meta-analysis rules (e.g., shr-00049).",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00067",
      "type": "strategy",
      "condition": "IF a claim requires strict verbatim verification, AND any evidence derived from an AI summary is initially considered as primary for confirming the precise wording of a quote.",
      "action": "THEN a mandatory secondary verification step must be performed using direct transcripts, official press releases, or other higher-fidelity primary sources to confirm the exact wording. If discrepancies are found, or if higher-fidelity sources are unavailable after diligent search, the AI summary evidence must be deemed insufficient for strict verbatim confirmation, and this limitation must be explicitly stated in the reasoning.",
      "confidence": 0.9,
      "evidence_count": 1,
      "created_from": "case_20240723_120000",
      "created_at": "2026-01-03 20:22:34.771700",
      "parent_rule": "shr-00030",
      "description": "This rule refines `shr-00030` by mandating a critical secondary verification step when AI summaries are inadvertently or conditionally used as primary evidence for verbatim quote verification. It ensures that despite existing prohibitions, any reliance on AI summaries for such specific tasks is immediately cross-referenced with higher-fidelity sources, thereby preventing inaccuracies and strengthening the rigor of verbatim checks.",
      "active": true,
      "memory_type": "trust"
    },
    {
      "rule_id": "shr-00072",
      "type": "strategy",
      "condition": "IF a claim involves scientific or medical study findings AND evidence contains expert qualifications, caveats, or statements about the preliminary nature or need for further trials",
      "action": "THEN the agent must explicitly search for, extract, and integrate these nuances (e.g., 'preliminary findings', 'requires Phase III trial', 'expert disagreement', 'limited sample size', 'animal studies only') into the final reasoning to provide a comprehensive and accurate assessment that reflects the scientific context and limitations.",
      "confidence": 0.85,
      "evidence_count": 1,
      "created_from": "case_20240604_120000",
      "created_at": "2026-01-03 20:35:45.895042",
      "parent_rule": null,
      "description": "This rule addresses a critical reasoning gap where the agent failed to incorporate crucial scientific caveats or expert qualifications into its reasoning for medical or scientific claims. It mandates explicit integration of such nuances (e.g., preliminary results, need for further trials, expert consensus/disagreement) to prevent presenting findings as more definitive than warranted, ensuring a comprehensive and accurate assessment of scientific claims by reflecting their true scientific context and limitations.",
      "active": true,
      "memory_type": "trust"
    }
  ],
  "last_updated": "2026-01-03 20:35:45.897949",
  "total_cases_processed": 46
}